In [70]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
print(pd.__version__)

2.3.2

In [71]:
df = pd.DataFrame({"foo": [1, 2, 3], "bar": [4, 5, 6]})
subset = df["foo"]
subset.iloc[0] = 100
df

   foo  bar
0    1    4
1    2    5
2    3    6

In [72]:
pd.options.mode.copy_on_write = True

In [73]:
df = pd.DataFrame({"foo": [1, 2, 3], "bar": [4, 5, 6]})
subset = df["foo"]
subset.iloc[0] = 100
df

   foo  bar
0    1    4
1    2    5
2    3    6

In [74]:
df = pd.DataFrame(np.arange(25).reshape(5, 5), index=list("abcde"), columns=list("abcde"))
df

    a   b   c   d   e
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [75]:
df.loc[["a", "c", "e"], ["b", "d"]]

    b   d
a   1   3
c  11  13
e  21  23

In [76]:
s = pd.Series(np.random.randn(5))

In [77]:
type(s[2:5])

pandas.core.series.Series

In [78]:
df1 = pd.DataFrame(np.random.randn(6, 4),
                   index=list('abcdef'),
                   columns=list('ABCD'))

In [79]:
df1

          A         B         C         D
a -0.525839  0.108770 -0.017902  0.931251
b -1.233784 -0.860538  0.260541  0.050728
c  0.958933 -1.755978  1.001678  1.545943
d  0.935215 -0.953185  0.441977 -1.781558
e  0.065509  0.118187 -0.946574 -0.588619
f  0.988193 -0.691143 -0.276747  0.986984

In [80]:
df1.loc[['a', 'c'], "B"]

a    0.108770
c   -1.755978
Name: B, dtype: float64

In [81]:
df1.query('(B > 0) and (C > 0)')

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [82]:
df1.loc[:, df1.loc['a'] > 0]

          B         D
a  0.108770  0.931251
b -0.860538  0.050728
c -1.755978  1.545943
d -0.953185 -1.781558
e  0.118187 -0.588619
f -0.691143  0.986984

In [83]:
bb = pd.read_csv('data/baseball.csv', index_col='id')

In [84]:
bb.groupby(['year', 'team']).sum(numeric_only=True).query('r>100')

           stint    g    ab    r    h  X2b  X3b  hr    rbi    sb   cs   bb  \
year team
2007 CIN       6  379   745  101  203   35    2  36  125.0  10.0  1.0  105
     DET       5  301  1062  162  283   54    4  37  144.0  24.0  7.0   97
     HOU       4  311   926  109  218   47    6  14   77.0  10.0  4.0   60
     LAN      11  413  1021  153  293   61    3  36  154.0   7.0  5.0  114
     NYN      13  622  1854  240  509  101    3  61  243.0  22.0  4.0  174
     SFN       5  482  1305  198  337   67    6  40  171.0  26.0  7.0  235
     TEX       2  198   729  115  200   40    4  28  115.0  21.0  4.0   73
     TOR       4  459  1408  187  378   96    2  58  223.0   4.0  2.0  190

              so   ibb   hbp    sh    sf  gidp
year team
2007 CIN   127.0  14.0   1.0   1.0  15.0  18.0
     DET   176.0   3.0  10.0   4.0   8.0  28.0
     HOU   212.0   3.0   9.0  16.0   6.0  17.0
     LAN   141.0   8.0   9.0   3.0   8.0  29.0
     NYN   310.0  24.0  23.0  18.0  15.0  48.0
     SFN   188.0  51.0   8.0  16.0   6.0  41.0
     TEX   140.0   4.0   5.0   2.0   8.0  16.0
     TOR   265.0  16.0  12.0   4.0  16.0  38.0

In [85]:
dfd = pd.DataFrame({'A': [1, 2, 3],
                    'B': [4, 5, 6]},
                   index=list('abc'))
dfd

   A  B
a  1  4
b  2  5
c  3  6

In [86]:
dfd.loc[dfd.index[[0, 2]], "A"]

a    1
c    3
Name: A, dtype: int64

In [87]:
dfd.iloc[[0, 2], dfd.columns.get_indexer(['A'])]

   A
a  1
c  3

In [88]:
df

    a   b   c   d   e
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [89]:
df.sample(n=3)

    a   b   c   d   e
d  15  16  17  18  19
a   0   1   2   3   4
c  10  11  12  13  14

In [90]:
df.sample(frac=0.3)

    a   b   c   d   e
e  20  21  22  23  24
b   5   6   7   8   9

In [91]:
df.sample(n=10, replace=True)

    a   b   c   d   e
d  15  16  17  18  19
c  10  11  12  13  14
e  20  21  22  23  24
b   5   6   7   8   9
e  20  21  22  23  24
a   0   1   2   3   4
e  20  21  22  23  24
d  15  16  17  18  19
c  10  11  12  13  14
d  15  16  17  18  19

In [92]:
df.sample(n=5, weights=df["b"], random_state=42)

    a   b   c   d   e
d  15  16  17  18  19
e  20  21  22  23  24
c  10  11  12  13  14
b   5   6   7   8   9
a   0   1   2   3   4

In [93]:
df.loc['f'] = np.random.randn(len(df.loc['a']))

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, a to f
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       6 non-null      float64
 1   b       6 non-null      float64
 2   c       6 non-null      float64
 3   d       6 non-null      float64
 4   e       6 non-null      float64
dtypes: float64(5)
memory usage: 288.0+ bytes

In [95]:
df.head()

      a     b     c     d     e
a   0.0   1.0   2.0   3.0   4.0
b   5.0   6.0   7.0   8.0   9.0
c  10.0  11.0  12.0  13.0  14.0
d  15.0  16.0  17.0  18.0  19.0
e  20.0  21.0  22.0  23.0  24.0

In [96]:
dfi = pd.DataFrame(np.arange(6).reshape(3, 2),
                   columns=['A', 'B'])

In [97]:
dfi

   A  B
0  0  1
1  2  3
2  4  5

In [98]:
dfi.loc[3] = [10, 20]

In [99]:
dfi

    A   B
0   0   1
1   2   3
2   4   5
3  10  20

In [100]:
dates = pd.date_range('1/1/2000', periods=8)

df = pd.DataFrame(np.random.randn(8, 4),
                  index=dates, columns=['A', 'B', 'C', 'D'])

In [101]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 8 entries, 2000-01-01 to 2000-01-08
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       8 non-null      float64
 1   B       8 non-null      float64
 2   C       8 non-null      float64
 3   D       8 non-null      float64
dtypes: float64(4)
memory usage: 320.0 bytes

In [102]:
df.at[dates[5],'A']

np.float64(0.2048764672235381)

In [103]:
df.iat[5,0]

np.float64(0.2048764672235381)

In [104]:
df[(df['A'] > df['B']) & (df['A'] <= df['C'])]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [105]:
df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'three', 'two', 'one', 'six'],
                    'b': ['x', 'y', 'y', 'x', 'y', 'x', 'x'],
                    'c': np.random.randn(7)})

In [106]:
df2

       a  b         c
0    one  x  1.279092
1    one  y -1.307555
2    two  y -0.391437
3  three  x -0.324667
4    two  y  1.337947
5    one  x  0.141332
6    six  x -0.910087

In [107]:
rule = df2['a'].map(lambda x: x.startswith('t'))
rule

0    False
1    False
2     True
3     True
4     True
5    False
6    False
Name: a, dtype: bool

In [108]:
df2[rule & (df2['b'] == 'x')]

       a  b         c
3  three  x -0.324667

In [109]:
df3 = pd.DataFrame({'vals': [1, 2, 3, 4], 'ids': ['a', 'b', 'f', 'n'],
                   'ids2': ['a', 'n', 'c', 'n']})
df3

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c
3     4   n    n

In [110]:
values = ['a', 'b', 1, 3]
df3.isin(values)

    vals    ids   ids2
0   True   True   True
1  False   True  False
2   True  False  False
3  False  False  False

In [111]:
value_dict = {'vals': [1, 2]}
df3.isin(value_dict)

    vals    ids   ids2
0   True  False  False
1   True  False  False
2  False  False  False
3  False  False  False

In [112]:
values = {'ids': ['a', 'b'], 'ids2': ['a', 'c'], 'vals': [1, 3]}
mask = df3.isin(values).any(axis=1)

In [113]:
df3[mask]

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c

In [114]:
df

                   A         B         C         D
2000-01-01 -0.456356 -0.571193 -0.665961 -1.664937
2000-01-02 -0.909249  1.411187  0.605957 -0.202733
2000-01-03  1.219696 -0.731257  0.302224 -0.793246
2000-01-04  0.780031  1.125083  0.746829 -1.424494
2000-01-05  0.721772 -1.132520 -0.186757 -0.134916
2000-01-06  0.204876  0.851173 -0.196547  0.280314
2000-01-07  0.127462 -0.826615 -1.046245 -2.210647
2000-01-08  0.997673  1.033744 -0.545015  0.818074

In [115]:
df[df < 0]

                   A         B         C         D
2000-01-01 -0.456356 -0.571193 -0.665961 -1.664937
2000-01-02 -0.909249       NaN       NaN -0.202733
2000-01-03       NaN -0.731257       NaN -0.793246
2000-01-04       NaN       NaN       NaN -1.424494
2000-01-05       NaN -1.132520 -0.186757 -0.134916
2000-01-06       NaN       NaN -0.196547       NaN
2000-01-07       NaN -0.826615 -1.046245 -2.210647
2000-01-08       NaN       NaN -0.545015       NaN

In [116]:
df.where(df < 0)

                   A         B         C         D
2000-01-01 -0.456356 -0.571193 -0.665961 -1.664937
2000-01-02 -0.909249       NaN       NaN -0.202733
2000-01-03       NaN -0.731257       NaN -0.793246
2000-01-04       NaN       NaN       NaN -1.424494
2000-01-05       NaN -1.132520 -0.186757 -0.134916
2000-01-06       NaN       NaN -0.196547       NaN
2000-01-07       NaN -0.826615 -1.046245 -2.210647
2000-01-08       NaN       NaN -0.545015       NaN

In [117]:
df2 = df[df < 0]
df2

                   A         B         C         D
2000-01-01 -0.456356 -0.571193 -0.665961 -1.664937
2000-01-02 -0.909249       NaN       NaN -0.202733
2000-01-03       NaN -0.731257       NaN -0.793246
2000-01-04       NaN       NaN       NaN -1.424494
2000-01-05       NaN -1.132520 -0.186757 -0.134916
2000-01-06       NaN       NaN -0.196547       NaN
2000-01-07       NaN -0.826615 -1.046245 -2.210647
2000-01-08       NaN       NaN -0.545015       NaN

In [118]:
df.where(df < 0, 0)

                   A         B         C         D
2000-01-01 -0.456356 -0.571193 -0.665961 -1.664937
2000-01-02 -0.909249  0.000000  0.000000 -0.202733
2000-01-03  0.000000 -0.731257  0.000000 -0.793246
2000-01-04  0.000000  0.000000  0.000000 -1.424494
2000-01-05  0.000000 -1.132520 -0.186757 -0.134916
2000-01-06  0.000000  0.000000 -0.196547  0.000000
2000-01-07  0.000000 -0.826615 -1.046245 -2.210647
2000-01-08  0.000000  0.000000 -0.545015  0.000000

In [119]:
df4 = pd.DataFrame({'col1': list('ABBC'), 'col2': list('ZZXY')})
df4

  col1 col2
0    A    Z
1    B    Z
2    B    X
3    C    Y

In [120]:
rule = df4.where(df4['col2'] == 'Z')

In [121]:
df4['color'] = np.where(df4['col2'] == 'Z', 'green', 'red')

In [122]:
df4

  col1 col2  color
0    A    Z  green
1    B    Z  green
2    B    X    red
3    C    Y    red

In [123]:
conditions = [
    (df4['col2'] == 'Z') & (df4['col1'] == 'A'),
    (df4['col2'] == 'Z') & (df4['col1'] == 'B'),
    (df4['col1'] == 'B')
]
conditions

[0     True
 1    False
 2    False
 3    False
 dtype: bool,
 0    False
 1     True
 2    False
 3    False
 dtype: bool,
 0    False
 1     True
 2     True
 3    False
 Name: col1, dtype: bool]

In [124]:
choices = ['yellow', 'blue', 'purple']
df4['color'] = np.select(conditions, choices, default='black')

In [125]:
df4

  col1 col2   color
0    A    Z  yellow
1    B    Z    blue
2    B    X  purple
3    C    Y   black

In [126]:
n = 10
df5 = pd.DataFrame(np.random.rand(n, 3), columns=list("ABC"))
df5

          A         B         C
0  0.276100  0.974507  0.098133
1  0.939031  0.698746  0.245076
2  0.625063  0.121001  0.674347
3  0.524598  0.887053  0.577290
4  0.793730  0.241717  0.621523
5  0.381368  0.458551  0.366597
6  0.592953  0.591715  0.747140
7  0.251219  0.251699  0.868291
8  0.656255  0.978611  0.531135
9  0.596101  0.894106  0.763129

In [127]:
df5.query("(A < B) & (B > C)")

          A         B         C
0  0.276100  0.974507  0.098133
3  0.524598  0.887053  0.577290
5  0.381368  0.458551  0.366597
8  0.656255  0.978611  0.531135
9  0.596101  0.894106  0.763129

In [128]:
df7 = pd.DataFrame({'a': ['one', 'one', 'two', 'two', 'two', 'three', 'four'],
                    'b': ['x', 'y', 'x', 'y', 'x', 'x', 'x'],
                    'c': np.random.randn(7)})

In [129]:
df7

       a  b         c
0    one  x  0.737912
1    one  y -0.055841
2    two  x -0.738736
3    two  y -0.647944
4    two  x -0.778522
5  three  x -0.658724
6   four  x -0.169707

In [130]:
df7.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [131]:
df7.duplicated('a')

0    False
1     True
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [132]:
df7.duplicated('a', keep='last')

0     True
1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

In [133]:
df7.duplicated('a', keep=False)

0     True
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [134]:
df7.duplicated(['a', 'b'])

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [135]:
df8 = pd.DataFrame({'a': np.arange(6),
                    'b': np.random.randn(6)},
                   index=['a', 'a', 'b', 'c', 'b', 'a'])
df8

   a         b
a  0 -0.418978
a  1 -0.453180
b  2  0.221479
c  3 -1.981001
b  4  0.153800
a  5  0.807494

In [136]:
df8[~df8.index.duplicated()]

   a         b
a  0 -0.418978
b  2  0.221479
c  3 -1.981001

In [137]:
df8

   a         b
a  0 -0.418978
a  1 -0.453180
b  2  0.221479
c  3 -1.981001
b  4  0.153800
a  5  0.807494

In [139]:
id, cols = pd.factorize(df8['a'])

In [140]:
id

array([0, 1, 2, 3, 4, 5])

In [141]:
print(id)

[0 1 2 3 4 5]

In [142]:
df8.index

Index(['a', 'a', 'b', 'c', 'b', 'a'], dtype='object')

In [143]:
cols

Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [144]:
arrays = [
    ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
    ["one", "two", "one", "two", "one", "two", "one", "two"],
]
type(arrays)

list

In [145]:
arrays

[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
 ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]

In [146]:
tuples = list(zip(*arrays))
type(tuples)

list

In [147]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [148]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [149]:
index2 = pd.MultiIndex.from_tuples(zip(*arrays), names=['first', 'second'])

In [150]:
index2

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [151]:
s = pd.Series(np.random.randn(8), index2)

In [152]:
s

first  second
bar    one       0.326522
       two       0.586350
baz    one      -0.459119
       two      -0.662932
foo    one      -1.817157
       two      -0.166064
qux    one       0.320809
       two      -1.157858
dtype: float64

In [153]:
iterables = [['bar', 'baz', 'foo', 'quz'], ['red', 'green']]
index3 = pd.MultiIndex.from_product(iterables)
index3

MultiIndex([('bar',   'red'),
            ('bar', 'green'),
            ('baz',   'red'),
            ('baz', 'green'),
            ('foo',   'red'),
            ('foo', 'green'),
            ('quz',   'red'),
            ('quz', 'green')],
           )

In [154]:
df = pd.DataFrame(
    [["bar", "one"], ["bar", "two"], ["foo", "one"], ["foo", "two"]],
    columns=["first", "second"],
)

In [155]:
df

  first second
0   bar    one
1   bar    two
2   foo    one
3   foo    two

In [156]:
index3 = pd.MultiIndex.from_frame(df)
index3

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('foo', 'one'),
            ('foo', 'two')],
           names=['first', 'second'])

In [157]:
df = pd.DataFrame(np.random.randn(8,3), arrays)

In [158]:
df

                0         1         2
bar one -0.549399 -1.376557  2.351810
    two -0.378307 -0.233206 -0.785912
baz one -0.051163  1.207110 -1.329291
    two  0.139845 -0.621617 -1.217686
foo one -0.097998  0.246112 -1.167546
    two -0.938834  0.120633 -2.182840
qux one -0.440927  0.631858 -0.116765
    two -0.120227 -0.413899  0.412491

In [159]:
df = df.reset_index(drop=False)

In [160]:
df.columns

Index(['level_0', 'level_1', 0, 1, 2], dtype='object')

In [161]:
df = df.set_index(['level_0', 'level_1'])

In [162]:
df[df.level_0 == 'bar']

AttributeError: 'DataFrame' object has no attribute 'level_0'

In [163]:
df.index.names

FrozenList(['level_0', 'level_1'])

In [164]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [165]:
index.get_level_values(0)

Index(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'], dtype='object', name='first')

In [166]:
index.get_level_values('second')

Index(['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'], dtype='object', name='second')

In [167]:
df

                        0         1         2
level_0 level_1
bar     one     -0.549399 -1.376557  2.351810
        two     -0.378307 -0.233206 -0.785912
baz     one     -0.051163  1.207110 -1.329291
        two      0.139845 -0.621617 -1.217686
foo     one     -0.097998  0.246112 -1.167546
        two     -0.938834  0.120633 -2.182840
qux     one     -0.440927  0.631858 -0.116765
        two     -0.120227 -0.413899  0.412491

In [168]:
df

                        0         1         2
level_0 level_1
bar     one     -0.549399 -1.376557  2.351810
        two     -0.378307 -0.233206 -0.785912
baz     one     -0.051163  1.207110 -1.329291
        two      0.139845 -0.621617 -1.217686
foo     one     -0.097998  0.246112 -1.167546
        two     -0.938834  0.120633 -2.182840
qux     one     -0.440927  0.631858 -0.116765
        two     -0.120227 -0.413899  0.412491

In [169]:
dft = df.T

In [170]:
dft

level_0       bar                 baz                 foo                 qux  \
level_1       one       two       one       two       one       two       one
0       -0.549399 -0.378307 -0.051163  0.139845 -0.097998 -0.938834 -0.440927
1       -1.376557 -0.233206  1.207110 -0.621617  0.246112  0.120633  0.631858
2        2.351810 -0.785912 -1.329291 -1.217686 -1.167546 -2.182840 -0.116765

level_0
level_1       two
0       -0.120227
1       -0.413899
2        0.412491

In [171]:
df

                        0         1         2
level_0 level_1
bar     one     -0.549399 -1.376557  2.351810
        two     -0.378307 -0.233206 -0.785912
baz     one     -0.051163  1.207110 -1.329291
        two      0.139845 -0.621617 -1.217686
foo     one     -0.097998  0.246112 -1.167546
        two     -0.938834  0.120633 -2.182840
qux     one     -0.440927  0.631858 -0.116765
        two     -0.120227 -0.413899  0.412491

In [177]:
df.loc[['bar', 'foo'], 1]

level_0  level_1
bar      one       -1.376557
         two       -0.233206
foo      one        0.246112
         two        0.120633
Name: 1, dtype: float64

In [178]:
def mklbl(prefix, n):
    return ["%s%s" % (prefix, i) for i in range(n)]

In [180]:
mklbl("A", 4)

['A0', 'A1', 'A2', 'A3']

In [181]:
miindex = pd.MultiIndex.from_product(
    [mklbl("A", 4), mklbl("B", 2), mklbl("C", 4), mklbl("D", 2)]
)


micolumns = pd.MultiIndex.from_tuples(
    [("a", "foo"), ("a", "bar"), ("b", "foo"), ("b", "bah")], names=["lvl0", "lvl1"]
)


dfmi = (
    pd.DataFrame(
        np.arange(len(miindex) * len(micolumns)).reshape(
            (len(miindex), len(micolumns))
        ),
        index=miindex,
        columns=micolumns,
    )
    .sort_index()
    .sort_index(axis=1)
)

dfmi

lvl0           a         b
lvl1         bar  foo  bah  foo
A0 B0 C0 D0    1    0    3    2
         D1    5    4    7    6
      C1 D0    9    8   11   10
         D1   13   12   15   14
      C2 D0   17   16   19   18
...          ...  ...  ...  ...
A3 B1 C1 D1  237  236  239  238
      C2 D0  241  240  243  242
         D1  245  244  247  246
      C3 D0  249  248  251  250
         D1  253  252  255  254

[64 rows x 4 columns]

In [192]:
dfmi.loc[(slice("A1", "A2"), slice(None), ["C1"])]

lvl0           a         b
lvl1         bar  foo  bah  foo
A1 B0 C1 D0   73   72   75   74
         D1   77   76   79   78
   B1 C1 D0  105  104  107  106
         D1  109  108  111  110
A2 B0 C1 D0  137  136  139  138
         D1  141  140  143  142
   B1 C1 D0  169  168  171  170
         D1  173  172  175  174

In [193]:
df

                        0         1         2
level_0 level_1
bar     one     -0.549399 -1.376557  2.351810
        two     -0.378307 -0.233206 -0.785912
baz     one     -0.051163  1.207110 -1.329291
        two      0.139845 -0.621617 -1.217686
foo     one     -0.097998  0.246112 -1.167546
        two     -0.938834  0.120633 -2.182840
qux     one     -0.440927  0.631858 -0.116765
        two     -0.120227 -0.413899  0.412491

In [196]:
df.xs("baz", level="level_0")

                0         1         2
level_1
one     -0.051163  1.207110 -1.329291
two      0.139845 -0.621617 -1.217686

In [201]:
dfmi.index.names

FrozenList([None, None, None, None])

In [213]:
dfmi.loc["A1", slice(None), slice("C1", "C3")]["a"]

lvl1         bar  foo
A1 B0 C1 D0   73   72
         D1   77   76
      C2 D0   81   80
         D1   85   84
      C3 D0   89   88
         D1   93   92
   B1 C1 D0  105  104
         D1  109  108
      C2 D0  113  112
         D1  117  116
      C3 D0  121  120
         D1  125  124

In [216]:
dfmi.loc["A1", (slice(None), "foo")]

lvl0        a    b
lvl1      foo  foo
B0 C0 D0   64   66
      D1   68   70
   C1 D0   72   74
      D1   76   78
   C2 D0   80   82
      D1   84   86
   C3 D0   88   90
      D1   92   94
B1 C0 D0   96   98
      D1  100  102
   C1 D0  104  106
      D1  108  110
   C2 D0  112  114
      D1  116  118
   C3 D0  120  122
      D1  124  126

In [215]:
dfmi.loc["A1", (slice(None), "foo")]

lvl0        a    b
lvl1      foo  foo
B0 C0 D0   64   66
      D1   68   70
   C1 D0   72   74
      D1   76   78
   C2 D0   80   82
      D1   84   86
   C3 D0   88   90
      D1   92   94
B1 C0 D0   96   98
      D1  100  102
   C1 D0  104  106
      D1  108  110
   C2 D0  112  114
      D1  116  118
   C3 D0  120  122
      D1  124  126

In [217]:
df

                        0         1         2
level_0 level_1
bar     one     -0.549399 -1.376557  2.351810
        two     -0.378307 -0.233206 -0.785912
baz     one     -0.051163  1.207110 -1.329291
        two      0.139845 -0.621617 -1.217686
foo     one     -0.097998  0.246112 -1.167546
        two     -0.938834  0.120633 -2.182840
qux     one     -0.440927  0.631858 -0.116765
        two     -0.120227 -0.413899  0.412491

In [218]:
df.xs("one", level="level_1")

                0         1         2
level_0
bar     -0.549399 -1.376557  2.351810
baz     -0.051163  1.207110 -1.329291
foo     -0.097998  0.246112 -1.167546
qux     -0.440927  0.631858 -0.116765

In [223]:
df.loc[(slice(None), "one"),:]

                        0         1         2
level_0 level_1
bar     one     -0.549399 -1.376557  2.351810
baz     one     -0.051163  1.207110 -1.329291
foo     one     -0.097998  0.246112 -1.167546
qux     one     -0.440927  0.631858 -0.116765

In [224]:
dfT = df.T

In [225]:
dfT

level_0       bar                 baz                 foo                 qux  \
level_1       one       two       one       two       one       two       one
0       -0.549399 -0.378307 -0.051163  0.139845 -0.097998 -0.938834 -0.440927
1       -1.376557 -0.233206  1.207110 -0.621617  0.246112  0.120633  0.631858
2        2.351810 -0.785912 -1.329291 -1.217686 -1.167546 -2.182840 -0.116765

level_0
level_1       two
0       -0.120227
1       -0.413899
2        0.412491

In [227]:
dfT.xs("one", level="level_1", axis=1)

level_0       bar       baz       foo       qux
0       -0.549399 -0.051163 -0.097998 -0.440927
1       -1.376557  1.207110  0.246112  0.631858
2        2.351810 -1.329291 -1.167546 -0.116765

In [231]:
dfT.xs(("bar", "one"), level=("level_0", "level_1"), axis=1, drop_level=False)

level_0       bar
level_1       one
0       -0.549399
1       -1.376557
2        2.351810

In [244]:
midx = pd.MultiIndex(
    levels=[["zero", "one"], ["x", "y"]], codes=[[1, 1, 0, 0], [1, 0, 1, 0]]
)


df = pd.DataFrame(np.random.randn(4, 3), index=midx)
df.columns = ["GDP", "Inflation", "Employment"]

df

             GDP  Inflation  Employment
one  y  0.671532  -0.722426    1.244712
     x -0.388794  -0.409187   -1.322249
zero y -0.728645  -2.138293   -0.644555
     x -1.864069   0.325523    0.466384

In [247]:
df[["GDP", "Inflation"]].groupby(level=0).mean()

           GDP  Inflation
one   0.141369  -0.565806
zero -1.296357  -0.906385

In [236]:
df.groupby(level=0)

In [248]:
df

             GDP  Inflation  Employment
one  y  0.671532  -0.722426    1.244712
     x -0.388794  -0.409187   -1.322249
zero y -0.728645  -2.138293   -0.644555
     x -1.864069   0.325523    0.466384

In [249]:
df.swaplevel(0, 1, axis=0)

             GDP  Inflation  Employment
y one   0.671532  -0.722426    1.244712
x one  -0.388794  -0.409187   -1.322249
y zero -0.728645  -2.138293   -0.644555
x zero -1.864069   0.325523    0.466384

In [250]:
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)


df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)


df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)

In [251]:
frames = [df1, df2, df3]
frames

[    A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1
 2  A2  B2  C2  D2
 3  A3  B3  C3  D3,
     A   B   C   D
 4  A4  B4  C4  D4
 5  A5  B5  C5  D5
 6  A6  B6  C6  D6
 7  A7  B7  C7  D7,
       A    B    C    D
 8    A8   B8   C8   D8
 9    A9   B9   C9   D9
 10  A10  B10  C10  D10
 11  A11  B11  C11  D11]

In [252]:
combined = pd.concat(frames)

In [253]:
combined

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [254]:
df4 = pd.DataFrame(
    {
        "B": ["B2", "B3", "B6", "B7"],
        "D": ["D2", "D3", "D6", "D7"],
        "F": ["F2", "F3", "F6", "F7"],
    },
    index=[2, 3, 6, 7],
)
df4

    B   D   F
2  B2  D2  F2
3  B3  D3  F3
6  B6  D6  F6
7  B7  D7  F7

In [261]:
pd.concat([df1, df4], axis=1, join='inner')

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [259]:
pd.concat([df1, df4], axis=1)

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [262]:
pd.concat([df1, df4], axis=1).reindex(df1.index)

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [263]:
combined_ml = pd.concat(frames, keys=["US", "CA", "GB"])

In [264]:
combined_ml

         A    B    C    D
US 0    A0   B0   C0   D0
   1    A1   B1   C1   D1
   2    A2   B2   C2   D2
   3    A3   B3   C3   D3
CA 4    A4   B4   C4   D4
   5    A5   B5   C5   D5
   6    A6   B6   C6   D6
   7    A7   B7   C7   D7
GB 8    A8   B8   C8   D8
   9    A9   B9   C9   D9
   10  A10  B10  C10  D10
   11  A11  B11  C11  D11

In [265]:
combined_ml.loc["CA"]

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [266]:
frames2 = {"EU": df1, "JP": df2, "AX": df3}
combined_ml2 = pd.concat(frames2)

In [267]:
combined_ml2

         A    B    C    D
EU 0    A0   B0   C0   D0
   1    A1   B1   C1   D1
   2    A2   B2   C2   D2
   3    A3   B3   C3   D3
JP 4    A4   B4   C4   D4
   5    A5   B5   C5   D5
   6    A6   B6   C6   D6
   7    A7   B7   C7   D7
AX 8    A8   B8   C8   D8
   9    A9   B9   C9   D9
   10  A10  B10  C10  D10
   11  A11  B11  C11  D11

In [269]:
combined_ml2.index.levels

FrozenList([['EU', 'JP', 'AX'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

In [274]:
s2 = pd.Series(["X0", "X1", "X2", "X3"], index={"A", "B", "C", "D"})
s2.to_frame().T

    A   C   B   D
0  X0  X1  X2  X3

In [272]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [279]:
combined_ml3 = pd.concat([df1, s2.to_frame().T], ignore_index=True)

In [280]:
combined_ml3

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  X0  X2  X1  X3